{
  "backend/main.mo": "Empty Motoko actor with no implemented logic.",
  "feature_evidence.json": "Feature evidence report specifying a styling update to TryDemoSection.tsx.",
  "frontend-file-summaries.txt": "Prewritten summaries describing each frontend component and content file.",
  "frontend/index.css": "Global Tailwind-based style definitions using OKLCH variables for light and dark themes.",
  "frontend/index.html": "HTML entry point containing metadata, Open Graph tags, and script bootstrapping.",
  "frontend/src/App.tsx": "Top-level React component assembling all marketing sections into a single-page layout.",
  "frontend/src/components/CapabilitiesSection.tsx": "Renders categorized capability cards with inputs, outputs, tags, and descriptions.",
  "frontend/src/components/ContactSection.tsx": "Contact form that builds a mailto link and displays a success alert after submission.",
  "frontend/src/components/FAQSection.tsx": "Accordion-based FAQ list covering common questions about SentinelAI.",
  "frontend/src/components/HeroSection.tsx": "Renders the main hero section with background image, headline, description, demo button, sales contact button, and feature stats.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays the workflow steps and safe testing practices using cards with mapped content arrays.",
  "frontend/src/components/SafetySecuritySection.tsx": "Shows security features, a disclaimer, and detailed feature cards describing SentinelAI’s security practices.",
  "frontend/src/components/SiteFooter.tsx": "Provides footer layout with branding, navigation buttons, external links, and smooth-scroll behavior.",
  "frontend/src/components/SiteHeader.tsx": "Implements the sticky header with logo, navigation, scroll detection, mobile menu, and demo link.",
  "frontend/src/components/TryDemoSection.tsx": "Presents demo information, prompts, disclaimers, and a button linking to the demo environment.",
  "frontend/src/components/UseCasesSection.tsx": "Renders a section listing industries, their descriptions, example use cases, and tags using UI cards and icons.",
  "frontend/src/content/capabilities.ts": "Exports structured capability data describing NLP, document intelligence, and content generation features with inputs, outputs, and constraints.",
  "frontend/src/content/howItWorks.ts": "Provides workflow steps for using the demo and safe testing guidelines with titles, descriptions, and feature lists.",
  "frontend/src/content/tryDemo.ts": "Defines suggested demo prompts and a disclaimer about safe data usage in the test environment.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity, refreshing related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an authentication context for Internet Identity, handling login, identity persistence, and status tracking.",
  "frontend/src/index.css": "Sets global Tailwind-based styles including theme variables, dark mode rules, accessibility focus states, and typography.",
  "frontend/src/main.tsx": "Bootstraps the React app with React Query and Internet Identity providers and loads global styles.",
  "frontend/tailwind.config.js": "Configures Tailwind with typography, container queries, custom OKLCH color palette, extended theme settings, and animation keyframes.",
  "project_state.json": "Defines the project’s current build state, requirements, design guidelines, and feature list for a government‑grade marketing website."
}