{
  "backend/main.mo": "Motoko canister storing predefined Q&A pairs and exposing getAnswer with basic matching plus a health check.",
  "feature_evidence.json": "Feature evidence report detailing branding‑replacement tasks, affected files, components, and test IDs.",
  "frontend-file-summaries.txt": "List of short summaries for all frontend components, content files, and configuration files.",
  "frontend/docs/smoke-test-assistant.md": "Smoke test checklist describing end‑to‑end validation steps for the AI Assistant feature.",
  "frontend/index.css": "Global Tailwind-based style definitions using OKLCH tokens for light and dark themes.",
  "frontend/index.html": "Main HTML entry with metadata, OG tags, favicon, and script mount point.",
  "frontend/src/App.tsx": "Top-level React app composing all marketing and assistant sections with header, footer, and health banner.",
  "frontend/src/components/AssistantSection.tsx": "Interactive assistant form handling questions, backend health gating, loading states, errors, and retries.",
  "frontend/src/components/BackendHealthBanner.tsx": "Banner that displays a warning when backend health is reported as unhealthy.",
  "frontend/src/components/CapabilitiesSection.tsx": "Renders a capabilities section displaying categorized AI features with inputs, outputs, constraints, and tags using cards and badges.",
  "frontend/src/components/ContactSection.tsx": "Implements a contact form that constructs a mailto link on submit and displays a success alert, with input handling and submission state.",
  "frontend/src/components/FAQSection.tsx": "Displays a list of FAQs using an accordion component, each containing a question and answer about product usage and policies.",
  "frontend/src/components/HeroSection.tsx": "Shows the landing hero with headline, CTA buttons, and stats, including smooth scroll behavior to the contact section.",
  "frontend/src/components/HowItWorksSection.tsx": "Presents workflow steps and safe testing practices using cards populated from content arrays.",
  "frontend/src/components/SafetySecuritySection.tsx": "Lists security features in card format, each with an icon, description, and detailed bullet points.",
  "frontend/src/components/SiteFooter.tsx": "Footer component with branding, navigation buttons that scroll to sections, and external links.",
  "frontend/src/components/SiteHeader.tsx": "Header with scroll detection, navigation buttons for section scrolling, and mobile menu handling.",
  "frontend/src/components/TryDemoSection.tsx": "Section displaying suggested demo prompts in cards and a link to launch the demo environment.",
  "frontend/src/components/UseCasesSection.tsx": "Displays industry-specific AI use cases with icons, descriptions, examples, and tags.",
  "frontend/src/content/capabilities.ts": "Exports a structured list of AI capability categories with detailed items and metadata.",
  "frontend/src/content/howItWorks.ts": "Defines workflow steps and safe testing practices for using the demo environment.",
  "frontend/src/content/tryDemo.ts": "Provides suggested prompt examples with expected outputs for trying the demo.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, and invalidates dependent queries when the identity changes.",
  "frontend/src/hooks/useBackendHealth.ts": "Checks backend health via the actor’s healthy() method and exposes a status with retry and interval polling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, manages AuthClient creation, login flow, stored identity, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation for getAnswer that validates input, checks backend health, calls the actor, and sanitizes IC errors.",
  "frontend/src/index.css": "Tailwind setup defining government‑grade color variables, base styles, dark mode variants, and accessibility focus rules.",
  "frontend/src/main.tsx": "Bootstraps the app with React, setting up QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/src/utils/icErrors.ts": "Detects IC replica rejection errors and returns sanitized user‑friendly messages while logging full details.",
  "frontend/tailwind.config.js": "Configures Tailwind theme extensions, color tokens from CSS variables, typography, container queries, and animations.",
  "project_state.json": "Tracks project state, requirements, branding updates, known issues, and deployment/assistant backend problems."
}