{
  "backend/main.mo": "Actor initializes curatedAnswers map and ties in migration run logic.",
  "backend/migration.mo": "Defines old/new actor types and provides default curatedAnswers for migration.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and tests.",
  "frontend-file-summaries.txt": "Contains frontend file paths with short descriptive summaries for each component or asset.",
  "frontend/docs/smoke-test-assistant.md": "Smoke test checklist describing steps to verify assistant health, Q&A flow, and recovery behavior.",
  "frontend/index.css": "Defines global Tailwind base styles and OKLCH design tokens for light and dark modes.",
  "frontend/index.html": "HTML entry file defining metadata, social tags, and mounting point for the React app.",
  "frontend/src/App.tsx": "Top-level React component assembling all page sections and layout structure.",
  "frontend/src/components/AssistantSection.tsx": "Interactive AI assistant component handling user questions, backend health gating, and answer fetching.",
  "frontend/src/components/BackendHealthBanner.tsx": "Displays a warning banner when the backend health check reports an unhealthy state.",
  "frontend/src/components/CapabilitiesSection.tsx": "Renders categorized AI capability cards using structured content data.",
  "frontend/src/components/ContactSection.tsx": "Contact form that builds a mailto link, triggers email client, and shows a temporary success alert.",
  "frontend/src/components/FAQSection.tsx": "FAQ accordion listing common questions and detailed answers about the service.",
  "frontend/src/components/HeroSection.tsx": "Hero banner with marketing messaging, demo CTA button, and scroll-to-contact functionality.",
  "frontend/src/components/HowItWorksSection.tsx": "Renders a multi-step workflow and safe testing practices using mapped content arrays and stylized cards.",
  "frontend/src/components/SafetySecuritySection.tsx": "Displays a grid of security features with icons, descriptions, and details for each item.",
  "frontend/src/components/SiteFooter.tsx": "Provides a footer with branding, navigation buttons using smooth-scroll, and external links.",
  "frontend/src/components/SiteHeader.tsx": "Implements a responsive header with scroll-based styling, navigation, mobile menu, and demo link.",
  "frontend/src/components/TryDemoSection.tsx": "Shows suggested prompts in card format and provides a link to launch the demo environment.",
  "frontend/src/components/UseCasesSection.tsx": "Lists industry-specific use cases with icons, descriptions, examples, and tags.",
  "frontend/src/content/capabilities.ts": "Defines categorized AI capability metadata including descriptions, inputs, outputs, and tags for UI display.",
  "frontend/src/content/howItWorks.ts": "Provides workflow steps and safe testing practices used to render process and security guidance in the UI.",
  "frontend/src/content/tryDemo.ts": "Contains suggested demo prompts with categories and expected outputs for guiding user testing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor instance tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useBackendHealth.ts": "Performs periodic backend health checks via the actor and derives a normalized healthy/checking/unhealthy status.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication, loading stored identities, handling login flow, and exposing context hooks.",
  "frontend/src/hooks/useQueries.ts": "Defines a mutation for getAnswer calls with input validation, backend health checks, and IC error sanitization.",
  "frontend/src/index.css": "Configures Tailwind styles and CSS variables for light/dark themes with strict grayscale and accent rules.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with query and identity providers before rendering.",
  "frontend/src/utils/icErrors.ts": "Provides detection and sanitization utilities for IC replica errors with safe user-facing messages.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom OKLCH-based color system, typography/plugins, and extended theme settings for layout, fonts, shadows, and animations.",
  "project_state.json": "Defines current project state, branding requirements, architectural notes, and known issues, emphasizing the Nexus Forge AI rebrand and fixing deployment and assistant functionality problems."
}