{
  "kind": "build_request",
  "title": "Fix assistant readiness so the AI Assistant works end-to-end without the 'Service Notice' banner",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-42",
      "text": "Fix the root cause of the backend reporting the assistant as not ready so `healthy()` returns `true` in normal deployed operation and the frontend does not show the red \"Service Notice\" banner or the \"Assistant service is not ready\" message when the assistant is actually usable.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "fix this now on it it says Assistant service is not ready and ervice Notice:\nAssistant service is not ready Some features may be temporarily unavailable. Please try again in a few moments. make sure the assistant service is working 100 percent no errors"
        ]
      },
      "acceptanceCriteria": [
        "On a fresh load of the deployed site, the backend health check resolves to healthy and `frontend/src/components/BackendHealthBanner.tsx` does not render the red \"Service Notice\" banner.",
        "In the deployed environment, calling `healthy()` from the frontend returns `true` and does not intermittently return `false` under normal conditions.",
        "The Assistant section input and submit button are enabled (not gated by an unhealthy status) under normal conditions.",
        "No console errors are emitted from the backend health check path during a normal page load."
      ]
    },
    {
      "id": "REQ-43",
      "text": "Ensure the Motoko assistant canister always has a non-empty curated knowledge base at runtime (including after upgrades) so that `healthy()` is a reliable readiness signal and never reports \"not ready\" due to missing/empty knowledge data.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make sure the assistant service is working 100 percent no errors"
        ]
      },
      "acceptanceCriteria": [
        "`healthy()` returns `true` if and only if the assistant knowledge base is available and non-empty.",
        "After an upgrade/redeploy scenario, the assistant knowledge base remains non-empty and `healthy()` still returns `true` without requiring manual intervention.",
        "If the knowledge base cannot be initialized for any reason, the backend fails safely (no traps) and `healthy()` returns `false` (so the UI can clearly communicate unavailability)."
      ]
    },
    {
      "id": "REQ-44",
      "text": "Make the assistant Q&A flow work end-to-end in production: submitting a question from `frontend/src/components/AssistantSection.tsx` must successfully call the Motoko `getAnswer(question)` method and return an answer without replica rejection errors or traps.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make sure the assistant service is working 100 percent no errors"
        ]
      },
      "acceptanceCriteria": [
        "From the deployed site, asking \"What is Nexus Forge AI?\" returns a deterministic English answer (not an error) and the UI displays it in the answer panel.",
        "The system does not produce IC replica rejection errors (e.g., IC0508 / reject code 5) during normal assistant usage.",
        "`getAnswer` never traps; for unknown questions it returns a professional English fallback answer (not an exception) branded as \"Nexus Forge AI\".",
        "No raw replica/debug payloads (CBOR, request IDs, reject codes) are shown to end users; user-facing errors remain sanitized."
      ]
    },
    {
      "id": "REQ-45",
      "text": "Adjust frontend health and error handling so transient backend issues do not incorrectly stick the UI in a \"not ready\" state; ensure health is rechecked and the assistant becomes usable automatically when the backend becomes healthy again.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Assistant service is not ready Some features may be temporarily unavailable. Please try again in a few moments."
        ]
      },
      "acceptanceCriteria": [
        "If the backend is temporarily unavailable and then recovers, the health status transitions back to healthy without a hard refresh, and the Assistant UI becomes enabled automatically.",
        "The banner and Assistant unavailable alert only appear when the latest health check is definitively unhealthy (not while still checking).",
        "User-facing messaging remains in English and stays consistent between the top banner and the Assistant section alert (no duplicated/garbled text)."
      ]
    },
    {
      "id": "REQ-46",
      "text": "Run the documented assistant smoke test checklist and fix any failures so the deployed build passes all assistant health and Q&A checks without errors.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "make sure the assistant service is working 100 percent no errors"
        ]
      },
      "acceptanceCriteria": [
        "All steps in `frontend/docs/smoke-test-assistant.md` pass on the deployed build, including: no health warning banner under normal operation, successful answer rendering, suggested questions working, and sanitized error handling.",
        "No runtime errors appear in the browser console during the full assistant flow (health check → submit question → receive answer)."
      ]
    }
  ],
  "constraints": [
    "Respect the single-actor backend architecture; keep Motoko logic in `backend/main.mo` and only add/modify `backend/migration.mo` if an actual state migration is required.",
    "Do not edit frontend files under `frontend/src/components/ui`, `frontend/src/hooks/useInternetIdentity.ts(x)`, `frontend/src/hooks/useActor.ts`, or `frontend/src/main.tsx` (immutable paths).",
    "All user-facing text introduced or modified must be in English."
  ],
  "nonGoals": [
    "Adding new product features beyond making the existing assistant service reliable and removing the erroneous \"not ready\"/service notice state.",
    "Integrating any third-party monitoring/alerting services or external databases.",
    "Changing the overall marketing site structure, navigation, or branding (outside of what is necessary to fix assistant readiness and errors)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}