{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Stabilize assistant readiness/health UX and production Q&A flow (frontend-only)",
  "requirements": [
    {
      "id": "REQ-42",
      "summary": "Harden frontend health-check handling so the app does not incorrectly report the assistant as not ready during normal operation.",
      "acceptanceCriteria": [
        "On a fresh load of the deployed site, the backend health check resolves to healthy and `frontend/src/components/BackendHealthBanner.tsx` does not render the red \"Service Notice\" banner.",
        "In the deployed environment, calling `healthy()` from the frontend returns `true` and does not intermittently return `false` under normal conditions.",
        "The Assistant section input and submit button are enabled (not gated by an unhealthy status) under normal conditions.",
        "No console errors are emitted from the backend health check path during a normal page load."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendHealth.ts",
          "operation": "modify",
          "description": "Adjust health-query behavior to be resilient to transient false/error results: avoid throwing when the actor is temporarily unavailable during initialization, reduce false-unhealthy flapping (e.g., confirm unhealthy results before reporting), and tune React Query options (refetch on focus/reconnect, interval behavior, stale/placeholder handling) so normal deployed loads converge to healthy without triggering the Service Notice. Leverage the existing core-infrastructure actor connection (createActorWithConfig) via useActor; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BackendHealthBanner.tsx",
          "operation": "modify",
          "description": "Update banner rendering logic to align with the improved health status semantics (only show on definitively unhealthy states, avoid flashing during rechecks) and keep messaging consistent, English-only. Uses existing shadcn-ui Alert for the banner; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AssistantSection.tsx",
          "operation": "modify",
          "description": "Ensure the assistant input/button are not incorrectly gated by transient or initializing health states (e.g., do not disable while health is still checking if last-known health is good), while still preventing submission when definitively unhealthy. Keep all user-facing text in English and consistent with the top banner. Uses existing shadcn-ui Card/Button/Textarea/Alert; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-44",
      "summary": "Ensure the assistant Q&A UI calls getAnswer reliably and displays sanitized responses/errors without exposing replica/debug payloads.",
      "acceptanceCriteria": [
        "From the deployed site, asking \"What is Nexus Forge AI?\" returns a deterministic English answer (not an error) and the UI displays it in the answer panel.",
        "The system does not produce IC replica rejection errors (e.g., IC0508 / reject code 5) during normal assistant usage.",
        "`getAnswer` never traps; for unknown questions it returns a professional English fallback answer (not an exception) branded as \"Nexus Forge AI\".",
        "No raw replica/debug payloads (CBOR, request IDs, reject codes) are shown to end users; user-facing errors remain sanitized."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Make the getAnswer mutation more production-resilient: coordinate with the health query to avoid false fast-fails during health rechecks, trigger a health recheck/invalidation on failures where appropriate, and ensure user-visible errors remain sanitized. Remove/avoid unconditional console.error logging during normal failures to satisfy smoke-test expectations (retain sanitized UI errors). Uses the existing core-infrastructure actor via useActor; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/icErrors.ts",
          "operation": "modify",
          "description": "Tighten sanitization to guarantee no raw replica/debug payloads are ever surfaced to end users and reduce noisy console error output in normal operation (prefer non-error logging where appropriate while preserving debuggability). All user-facing messaging must remain in English."
        },
        {
          "path": "frontend/src/components/AssistantSection.tsx",
          "operation": "modify",
          "description": "Ensure the UI always renders the returned answer string, and that any displayed error message comes only from the sanitized error pipeline (no accidental rendering of raw objects). Keep Nexus Forge AI branding and professional English fallback messaging. Uses existing shadcn-ui Alert/Button; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-45",
      "summary": "Prevent transient backend issues from sticking the UI in an unhealthy state; automatically recover to healthy without a hard refresh.",
      "acceptanceCriteria": [
        "If the backend is temporarily unavailable and then recovers, the health status transitions back to healthy without a hard refresh, and the Assistant UI becomes enabled automatically.",
        "The banner and Assistant unavailable alert only appear when the latest health check is definitively unhealthy (not while still checking).",
        "User-facing messaging remains in English and stays consistent between the top banner and the Assistant section alert (no duplicated/garbled text)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useBackendHealth.ts",
          "operation": "modify",
          "description": "Implement recovery-first state derivation: treat in-flight refetches as checking (not unhealthy), preserve last-known-good health to keep the assistant usable during rechecks, and ensure automatic revalidation on reconnect/focus so the UI self-recovers. Uses React Query and the existing core-infrastructure actor; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/BackendHealthBanner.tsx",
          "operation": "modify",
          "description": "Ensure the banner reflects the latest completed health result (not intermediate checking), and that its text matches the Assistant section alert. Uses shadcn-ui Alert; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/AssistantSection.tsx",
          "operation": "modify",
          "description": "Align assistant unavailable alert visibility with the updated health semantics (only on definitively unhealthy), and ensure controls re-enable automatically when health flips back to healthy. Uses shadcn-ui components; verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-46",
      "summary": "Update the assistant smoke test checklist to match the corrected frontend behavior and ensure the deployed build passes it without errors.",
      "acceptanceCriteria": [
        "All steps in `frontend/docs/smoke-test-assistant.md` pass on the deployed build, including: no health warning banner under normal operation, successful answer rendering, suggested questions working, and sanitized error handling.",
        "No runtime errors appear in the browser console during the full assistant flow (health check → submit question → receive answer)."
      ],
      "file_operations": [
        {
          "path": "frontend/docs/smoke-test-assistant.md",
          "operation": "modify",
          "description": "Revise the checklist so it accurately reflects intended client-side validation (e.g., long-question behavior), the improved non-sticky health/recovery behavior, and the requirement for no console errors during a normal flow. Keep all text in English."
        },
        {
          "path": "frontend/src/hooks/useBackendHealth.ts",
          "operation": "modify",
          "description": "Ensure the behavior required by the smoke test is implemented and stable (no banner under normal operation, auto-recovery without refresh). Uses React Query + core-infrastructure actor; verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Ensure the Q&A flow required by the smoke test behaves cleanly in production (sanitized errors, no noisy console errors in normal operation, successful answer rendering). Uses core-infrastructure actor; verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}